# Gaining Insights from Sales Data

Here we use the UCI Online Retail dataset to gain customer insights

In [50]:
# Import libraries
import pandas as pd
import datetime as dt
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

First, we import the data

In [13]:
data = pd.read_csv('google drive/freelance/own projects/customer_dataset/online_retail_data.csv', encoding='utf-8')

Now, let's have a quick look at this to see what the data looks like

In [14]:
print(data.dtypes)
data.head()

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,01/12/2010 08:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,01/12/2010 08:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,01/12/2010 08:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,01/12/2010 08:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,01/12/2010 08:26,3.39,17850.0,United Kingdom

Let's make the data column headers `snake_case` to make them easier to work with, and convert the dates to `datetime` object

In [15]:
data.columns = ['invoice_no', 'stock_code', 'description', 'quantity', 'invoice_date', 'unit_price', 'customer_id', 'country']
data.invoice_date = pd.to_datetime(data.invoice_date)
data.head()

,invoice_no,stock_code,description,quantity,invoice_date,unit_price,customer_id,country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-01-12 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-01-12 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-01-12 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-01-12 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-01-12 08:26:00,3.39,17850.0,United Kingdom

## Cohort Analysis
Let's break our customers into different cohorts based on the month they made their first purchase.

First, we need to create a separate column, `invoice_month`, in which we get the month of the invoice.

In [41]:
data['invoice_month'] = data['invoice_date'].dt.to_period('M').dt.to_timestamp()

Next, we group by `customer_id` and apply a transformation to find the lowest `invoice_month` for each. We store this in the `cohort_month` column.

In [42]:
data['cohort_month'] = data.groupby('customer_id')['invoice_month'].transform('min')

In [44]:
print(data.describe())

            quantity     unit_price    customer_id
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

Looks like there are a lot less `customer_id` than the others - probably NA values.

Let's drop these.

In [47]:
data = data.dropna()
data.shape

(406829, 10)

Next, we want to get the number of months between their first purchase and their current purchase. We'll call this the `cohort_index`.

Note that we add a "+1" to the difference between the months so that 0's are more easily interpretable.

In [56]:
data.cohort_index = pd.Series(((data.invoice_month - data.cohort_month) / np.timedelta64(1, 'M')).astype(int) + 1)